import 'dart:ui';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class data_class {
  // static List lnt = [
  //   perna.length,
  //   jiv.length,
  //   moh.length,
  //   yaad.length,
  //   otr.length,
  //   poli.length,
  //   love.length,
  //   sad.length
  //
  // ];
  static List name = [
    "प्रेरणा स्त्रोत शायरी",
    "जीवन शायरी",
    "मोहब्बत शायरी",
    "यादें शायरी",
    "अन्य शायरी",
    "राजनीति शायरी",
    "प्रेम शायरी",
    "दर्द शायरी"
  ];
  static List img = [
    "myasset/image/motivational.png",
    "myasset/image/kanjoos.png",
    "myasset/image/married.png",
    "myasset/image/officework.png",
    "myasset/image/santabanta.png",
    "myasset/image/politics.png",
    "myasset/image/love.png",
    "myasset/image/sad.png",
  ];
  static List perna = [
    """घर से बाहर कोलेज जाने के लिए वो
नकाब मे निकली......
सारी गली उनके पीछे निकली.....
इनकार करते थे वो हमारी मोहबत से.... 
और हमारी ही तसवीर उनकी किताब से निकली...""",
    """हर रिश्ते में विश्वास रहने दो;
जुबान पर हर वक़्त मिठास रहने दो; 
यही तो अंदाज़ है जिंदगी जीने का ; 
न खुद रहो उदास, न दूसरों को रहने दो..!""",
    """छू ले आसमान ज़मीन की तलाश ना कर,
जी ले ज़िंदगी खुशी की तलाश ना कर,
तकदीर बदल जाएगी खुद ही मेरे दोस्त, 
मुस्कुराना सीख ले वजह की तलाश ना कर.""",
    """जब टूटने लगे होसले तो बस ये याद रखना,
बिना मेहनत के हासिल तख्तो ताज नहीं होते,
ढूंड लेना अंधेरों में मंजिल अपनी,
जुगनू कभी रौशनी के मोहताज नहीं होते.""",
    """खुशबू बनकर गुलों से उड़ा करते हैं,
धुआं बनकर पर्वतों से उड़ा करते हैं,
ये कैंचियाँ खाक हमें उड़ने से रोकेगी,
हम परों से नहीं हौसलों से उड़ा करते हैं.""",
    """जिन्दगी में कई मुश्किलें आती है,
और इन्सान जिन्दा रहने से घबराता हैं,
ना जाने कैसे हजारो कांटो के बीच’
रह कर एक फूल मुस्कुराता है.""",  """घर से बाहर कोलेज जाने के लिए वो
नकाब मे निकली......
सारी गली उनके पीछे निकली.....
इनकार करते थे वो हमारी मोहबत से.... 
और हमारी ही तसवीर उनकी किताब से निकली...""",
    """हर रिश्ते में विश्वास रहने दो;
जुबान पर हर वक़्त मिठास रहने दो; 
यही तो अंदाज़ है जिंदगी जीने का ; 
न खुद रहो उदास, न दूसरों को रहने दो..!""",
    """छू ले आसमान ज़मीन की तलाश ना कर,
जी ले ज़िंदगी खुशी की तलाश ना कर,
तकदीर बदल जाएगी खुद ही मेरे दोस्त, 
मुस्कुराना सीख ले वजह की तलाश ना कर.""",
    """जब टूटने लगे होसले तो बस ये याद रखना,
बिना मेहनत के हासिल तख्तो ताज नहीं होते,
ढूंड लेना अंधेरों में मंजिल अपनी,
जुगनू कभी रौशनी के मोहताज नहीं होते.""",
    """खुशबू बनकर गुलों से उड़ा करते हैं,
धुआं बनकर पर्वतों से उड़ा करते हैं,
ये कैंचियाँ खाक हमें उड़ने से रोकेगी,
हम परों से नहीं हौसलों से उड़ा करते हैं.""",
    """जिन्दगी में कई मुश्किलें आती है,
और इन्सान जिन्दा रहने से घबराता हैं,
ना जाने कैसे हजारो कांटो के बीच’
रह कर एक फूल मुस्कुराता है.""",  """घर से बाहर कोलेज जाने के लिए वो
नकाब मे निकली......
सारी गली उनके पीछे निकली.....
इनकार करते थे वो हमारी मोहबत से.... 
और हमारी ही तसवीर उनकी किताब से निकली...""",
    """हर रिश्ते में विश्वास रहने दो;
जुबान पर हर वक़्त मिठास रहने दो; 
यही तो अंदाज़ है जिंदगी जीने का ; 
न खुद रहो उदास, न दूसरों को रहने दो..!""",
    """छू ले आसमान ज़मीन की तलाश ना कर,
जी ले ज़िंदगी खुशी की तलाश ना कर,
तकदीर बदल जाएगी खुद ही मेरे दोस्त, 
मुस्कुराना सीख ले वजह की तलाश ना कर.""",
    """जब टूटने लगे होसले तो बस ये याद रखना,
बिना मेहनत के हासिल तख्तो ताज नहीं होते,
ढूंड लेना अंधेरों में मंजिल अपनी,
जुगनू कभी रौशनी के मोहताज नहीं होते.""",
    """खुशबू बनकर गुलों से उड़ा करते हैं,
धुआं बनकर पर्वतों से उड़ा करते हैं,
ये कैंचियाँ खाक हमें उड़ने से रोकेगी,
हम परों से नहीं हौसलों से उड़ा करते हैं.""",
    """जिन्दगी में कई मुश्किलें आती है,
और इन्सान जिन्दा रहने से घबराता हैं,
ना जाने कैसे हजारो कांटो के बीच’
रह कर एक फूल मुस्कुराता है.""",
  ];
  static List moh = [
    """ मोहब्बत मे कभी कोई जबरदस्ती नही होती,
जब तुम्हारा जी चाहे तुम बस मेरे हो जाना !""",
    """ जिसे देखकर मैं दीवाना मदहोश हो जाए,
कुछ ऐसा ही प्यार भरा एहसास हो तुम !""",
    """ मोहब्बत का तो पता नहीं पर,
जो तुमसे है वो किसी और से नहीं !""",
    """ एक दिल ही तो था जो सिर्फ हमारा था,
बातों-बातों में तुमने इसे भी चुरा लिया""",
    """इश्क है या इबादत अब कुछ समझ नहीं आता,
  एक खूबसूरत ख्याल हो तुम जो दिल से नहीं जाता !""",
    """ मोहब्बत तो की थी हमने लेकिन,
यह सोच कर भुला दिया कि,
अभी घर की जिम्मेदारी बहुत है !""", """ मोहब्बत मे कभी कोई जबरदस्ती नही होती,
जब तुम्हारा जी चाहे तुम बस मेरे हो जाना !""",
    """ जिसे देखकर मैं दीवाना मदहोश हो जाए,
कुछ ऐसा ही प्यार भरा एहसास हो तुम !""",
    """ मोहब्बत का तो पता नहीं पर,
जो तुमसे है वो किसी और से नहीं !""",
    """ एक दिल ही तो था जो सिर्फ हमारा था,
बातों-बातों में तुमने इसे भी चुरा लिया""",
    """इश्क है या इबादत अब कुछ समझ नहीं आता,
  एक खूबसूरत ख्याल हो तुम जो दिल से नहीं जाता !""",
    """ मोहब्बत तो की थी हमने लेकिन,
यह सोच कर भुला दिया कि,
अभी घर की जिम्मेदारी बहुत है !""", """ मोहब्बत मे कभी कोई जबरदस्ती नही होती,
जब तुम्हारा जी चाहे तुम बस मेरे हो जाना !""",
    """ जिसे देखकर मैं दीवाना मदहोश हो जाए,
कुछ ऐसा ही प्यार भरा एहसास हो तुम !""",
    """ मोहब्बत का तो पता नहीं पर,
जो तुमसे है वो किसी और से नहीं !""",
    """ एक दिल ही तो था जो सिर्फ हमारा था,
बातों-बातों में तुमने इसे भी चुरा लिया""",
    """इश्क है या इबादत अब कुछ समझ नहीं आता,
  एक खूबसूरत ख्याल हो तुम जो दिल से नहीं जाता !""",
    """ मोहब्बत तो की थी हमने लेकिन,
यह सोच कर भुला दिया कि,
अभी घर की जिम्मेदारी बहुत है !""",
  ];
  static List jiv = [
    """अब तो इस तालाब का पानी बदल दो 
ये कँवल के फूल कुम्हलाने लगे हैं""",
    """ दिल सा वहशी कभी काबू में न आया यारो
हार कर बैठ गए जाल बिछाने वाले""",
    """ जम्हूरियत इक तर्ज़-ए-हुकूमत है कि जिसमें
बंदों को गिना करते हैं, तौला नहीं करते""",
    """ जिंदगी में कठिनाइयां आयें तो उदास ना होना
क्यूंकि कठिन रोल अच्छे एक्टर को ही दिए जाते हैं""",
    """ बुरे दिन का भी एक दिन बुरा वक्त आता है, सब्र रखो!""",
    """ जीवन में कठिनाइयाँ जितनी भी हो,
आपके पास जो भी है उनमे खुशियाँ ढूंढो!""", """अब तो इस तालाब का पानी बदल दो 
ये कँवल के फूल कुम्हलाने लगे हैं""",
    """ दिल सा वहशी कभी काबू में न आया यारो
हार कर बैठ गए जाल बिछाने वाले""",
    """ जम्हूरियत इक तर्ज़-ए-हुकूमत है कि जिसमें
बंदों को गिना करते हैं, तौला नहीं करते""",
    """ जिंदगी में कठिनाइयां आयें तो उदास ना होना
क्यूंकि कठिन रोल अच्छे एक्टर को ही दिए जाते हैं""",
    """ बुरे दिन का भी एक दिन बुरा वक्त आता है, सब्र रखो!""",
    """ जीवन में कठिनाइयाँ जितनी भी हो,
आपके पास जो भी है उनमे खुशियाँ ढूंढो!""", """अब तो इस तालाब का पानी बदल दो 
ये कँवल के फूल कुम्हलाने लगे हैं""",
    """ दिल सा वहशी कभी काबू में न आया यारो
हार कर बैठ गए जाल बिछाने वाले""",
    """ जम्हूरियत इक तर्ज़-ए-हुकूमत है कि जिसमें
बंदों को गिना करते हैं, तौला नहीं करते""",
    """ जिंदगी में कठिनाइयां आयें तो उदास ना होना
क्यूंकि कठिन रोल अच्छे एक्टर को ही दिए जाते हैं""",
    """ बुरे दिन का भी एक दिन बुरा वक्त आता है, सब्र रखो!""",
    """ जीवन में कठिनाइयाँ जितनी भी हो,
आपके पास जो भी है उनमे खुशियाँ ढूंढो!""",
  ];
  static List yaad = [
    """दिल को छू जाती है ये रात की आवाज,
चौंक उठते हैं कहीं तूने पुकारा तो नहीं !""",
    """कभी उनकी याद आती है कभी उनके ख्वाब आते हैं,
  मुझे सताने के सलीके तो उन्हें बेहिसाब आते हैं !""",
    """तुम्हारे बाद किसी को दिल में बसाया नहीं हमने,
  तुम चले गए तो क्या,
  यादों को मिटाया नहीं हमने !""",
    """ए खुदा उन के हर लम्हे की,
  हिफाजत करना,
  मासूम सा चहेरा उदास हो अच्छा नहीं लगता !""",
    """कुछ खूबसूरत पलों की महक सी है तेरी यादें,
  सुकून ये भी है कि ये कभी मुरझाती नहीं !""",
    """ैबठे थे अपनी मस्ती में कि अचानक तड़प उठे,
  आ कर तुम्हारी याद ने अच्छा नहीं किया !""","""दिल को छू जाती है ये रात की आवाज,
चौंक उठते हैं कहीं तूने पुकारा तो नहीं !""",
    """कभी उनकी याद आती है कभी उनके ख्वाब आते हैं,
  मुझे सताने के सलीके तो उन्हें बेहिसाब आते हैं !""",
    """तुम्हारे बाद किसी को दिल में बसाया नहीं हमने,
  तुम चले गए तो क्या,
  यादों को मिटाया नहीं हमने !""",
    """ए खुदा उन के हर लम्हे की,
  हिफाजत करना,
  मासूम सा चहेरा उदास हो अच्छा नहीं लगता !""",
    """कुछ खूबसूरत पलों की महक सी है तेरी यादें,
  सुकून ये भी है कि ये कभी मुरझाती नहीं !""",
    """ैबठे थे अपनी मस्ती में कि अचानक तड़प उठे,
  आ कर तुम्हारी याद ने अच्छा नहीं किया !""","""दिल को छू जाती है ये रात की आवाज,
चौंक उठते हैं कहीं तूने पुकारा तो नहीं !""",
    """कभी उनकी याद आती है कभी उनके ख्वाब आते हैं,
  मुझे सताने के सलीके तो उन्हें बेहिसाब आते हैं !""",
    """तुम्हारे बाद किसी को दिल में बसाया नहीं हमने,
  तुम चले गए तो क्या,
  यादों को मिटाया नहीं हमने !""",
    """ए खुदा उन के हर लम्हे की,
  हिफाजत करना,
  मासूम सा चहेरा उदास हो अच्छा नहीं लगता !""",
    """कुछ खूबसूरत पलों की महक सी है तेरी यादें,
  सुकून ये भी है कि ये कभी मुरझाती नहीं !""",
    """ैबठे थे अपनी मस्ती में कि अचानक तड़प उठे,
  आ कर तुम्हारी याद ने अच्छा नहीं किया !""",
  ];
  static List otr = [
    """ नई उड़ान भर जाने को
ढेरों खुशियां एक साथ मनाने को
ईश्वर की अपार अनुकंपा का
शुक्र दे जाने को ....
कोमल से हृदय में, ख्वाब नए संजोने को
अपने दृढ़ विश्वास से अपनी मंजिल पाने को
दीन -दुखी की सेवा कर
अपना नऔर पढ़ें""",
    """खेलने की उम्र में, मैंने काम करना सीख लिया, लगता है ज़िंदगी जीने का हुनर सीख गया। """,
    """कुछ तो आरज़ू रख, थोड़ा हौसला रख,
  ज़िंदगी जीने का अपना एक तरीका रख।""",
    """एक साँस सबके हिस्से से, हर पल घट जाती है, कोई जी लेता है जिंदगी तो किसी की कट जाती है।""",
    """ज़िंदगी भी किताब सी होती है,
  सब कुछ कह देती है खामोश रह के भी।""",
    """एक हादसा जरूर चाहिए ज़िंदगी में,
  सिर्फ बातों से आज तक कोई नहीं सीखा है।""",  """ नई उड़ान भर जाने को
ढेरों खुशियां एक साथ मनाने को
ईश्वर की अपार अनुकंपा का
शुक्र दे जाने को ....
कोमल से हृदय में, ख्वाब नए संजोने को
अपने दृढ़ विश्वास से अपनी मंजिल पाने को
दीन -दुखी की सेवा कर
अपना नऔर पढ़ें""",
    """खेलने की उम्र में, मैंने काम करना सीख लिया, लगता है ज़िंदगी जीने का हुनर सीख गया। """,
    """कुछ तो आरज़ू रख, थोड़ा हौसला रख,
  ज़िंदगी जीने का अपना एक तरीका रख।""",
    """एक साँस सबके हिस्से से, हर पल घट जाती है, कोई जी लेता है जिंदगी तो किसी की कट जाती है।""",
    """ज़िंदगी भी किताब सी होती है,
  सब कुछ कह देती है खामोश रह के भी।""",
    """एक हादसा जरूर चाहिए ज़िंदगी में,
  सिर्फ बातों से आज तक कोई नहीं सीखा है।""",  """ नई उड़ान भर जाने को
ढेरों खुशियां एक साथ मनाने को
ईश्वर की अपार अनुकंपा का
शुक्र दे जाने को ....
कोमल से हृदय में, ख्वाब नए संजोने को
अपने दृढ़ विश्वास से अपनी मंजिल पाने को
दीन -दुखी की सेवा कर
अपना नऔर पढ़ें""",
    """खेलने की उम्र में, मैंने काम करना सीख लिया, लगता है ज़िंदगी जीने का हुनर सीख गया। """,
    """कुछ तो आरज़ू रख, थोड़ा हौसला रख,
  ज़िंदगी जीने का अपना एक तरीका रख।""",
    """एक साँस सबके हिस्से से, हर पल घट जाती है, कोई जी लेता है जिंदगी तो किसी की कट जाती है।""",
    """ज़िंदगी भी किताब सी होती है,
  सब कुछ कह देती है खामोश रह के भी।""",
    """एक हादसा जरूर चाहिए ज़िंदगी में,
  सिर्फ बातों से आज तक कोई नहीं सीखा है।""",
  ];
  static List poli = [
    """सरकार को गरीबों का ख्याल कब आता है?
  चुनाव नजदीक आ जाए तो मुद्दा उछाला जाता है.""",
    """मुर्दा लोहे को औजार बनाने वाले,
  अपने आँसू को हथियार बनाने वाले,
  हमको बेकार समझते हैं सियासतदां
  मगर हम है इस मुल्क की सरकार बनाने वाले.""",
    """चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,
  लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.""",
    """ मूल जानना बड़ा कठिन हैं नदियों का, वीरो का,
  धनुष छोड़कर और गोत्र क्या होता हैं रणधीरो का,
  पाते हैं सम्मान तपोबल से भूतल पर शूर,
  “जाति-जाति” का शोर मचाते केवल कायर, क्रूर.""",
    """जहाँ सच हैं, वहाँ पर हम खड़े हैं,
  इसी खातिर आँखों में गड़े हैं.""",
    """नेता की बातों में सच्चाई का अभाव होता है,
  झूठ बोलना तो इनका स्वभाव होता हैं.""", """सरकार को गरीबों का ख्याल कब आता है?
  चुनाव नजदीक आ जाए तो मुद्दा उछाला जाता है.""",
    """मुर्दा लोहे को औजार बनाने वाले,
  अपने आँसू को हथियार बनाने वाले,
  हमको बेकार समझते हैं सियासतदां
  मगर हम है इस मुल्क की सरकार बनाने वाले.""",
    """चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,
  लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.""",
    """ मूल जानना बड़ा कठिन हैं नदियों का, वीरो का,
  धनुष छोड़कर और गोत्र क्या होता हैं रणधीरो का,
  पाते हैं सम्मान तपोबल से भूतल पर शूर,
  “जाति-जाति” का शोर मचाते केवल कायर, क्रूर.""",
    """जहाँ सच हैं, वहाँ पर हम खड़े हैं,
  इसी खातिर आँखों में गड़े हैं.""",
    """नेता की बातों में सच्चाई का अभाव होता है,
  झूठ बोलना तो इनका स्वभाव होता हैं.""", """सरकार को गरीबों का ख्याल कब आता है?
  चुनाव नजदीक आ जाए तो मुद्दा उछाला जाता है.""",
    """मुर्दा लोहे को औजार बनाने वाले,
  अपने आँसू को हथियार बनाने वाले,
  हमको बेकार समझते हैं सियासतदां
  मगर हम है इस मुल्क की सरकार बनाने वाले.""",
    """चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,
  लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.""",
    """ मूल जानना बड़ा कठिन हैं नदियों का, वीरो का,
  धनुष छोड़कर और गोत्र क्या होता हैं रणधीरो का,
  पाते हैं सम्मान तपोबल से भूतल पर शूर,
  “जाति-जाति” का शोर मचाते केवल कायर, क्रूर.""",
    """जहाँ सच हैं, वहाँ पर हम खड़े हैं,
  इसी खातिर आँखों में गड़े हैं.""",
    """नेता की बातों में सच्चाई का अभाव होता है,
  झूठ बोलना तो इनका स्वभाव होता हैं.""",
  ];
  static List love = [
    """हम अपने इख़्तियार की हद से गुजर गए,
  चाहा तुम्हें तो प्यार की हद से गुजर गए,
  जागी है अपने दिल में गुलाबों की आरज़ू,
  जब मौसम-ए-बहार की हद से गुजर गए""",
    """चुपके से आकर इस दिल में उतर जाते हो,
  सांसों में मेरी खुशबु बनके बिखर जाते हो,
  कुछ यूँ चला है तेरे इश्क का जादू,
  सोते-जागते तुम ही तुम नज़र आते हो""",
    """लोग तो मरते हैं हुस्न पर
  मेरा दिल तो तेरी गुफ्तगू पर मरता है""",
    """ मेरे प्रेम की शायरी तुम हो
  पागलपन की समझदारी तुम हो
  जब भी कुछ लिखने बैठा तो
  मेरी कलम मेरी डायरी तुम हो""",
    """मेरे दिल को तेरे दिल से बेहद प्रेम हो गया
  तुझे याद करना धड़कन से ज़रूरी काम हो गया
  कुछ तो जादूगरी है तेरे क़िरदार में
  तुझसे मोहब्बत करके मेरा नाम हो गया""",
    """  जब आँखें खुले तो सामने तेरा चेहरा हो
  तेरे साथ ही मेरी ज़िंदगी का हर सवेरा हो
  इस प्रेम में मेरी एक ही ख़्वाहिश बाकी
  मेरी हर ख़ुशी तेरी और तेरा हर ग़म मेरा हो""", """हम अपने इख़्तियार की हद से गुजर गए,
  चाहा तुम्हें तो प्यार की हद से गुजर गए,
  जागी है अपने दिल में गुलाबों की आरज़ू,
  जब मौसम-ए-बहार की हद से गुजर गए""",
    """चुपके से आकर इस दिल में उतर जाते हो,
  सांसों में मेरी खुशबु बनके बिखर जाते हो,
  कुछ यूँ चला है तेरे इश्क का जादू,
  सोते-जागते तुम ही तुम नज़र आते हो""",
    """लोग तो मरते हैं हुस्न पर
  मेरा दिल तो तेरी गुफ्तगू पर मरता है""",
    """ मेरे प्रेम की शायरी तुम हो
  पागलपन की समझदारी तुम हो
  जब भी कुछ लिखने बैठा तो
  मेरी कलम मेरी डायरी तुम हो""",
    """मेरे दिल को तेरे दिल से बेहद प्रेम हो गया
  तुझे याद करना धड़कन से ज़रूरी काम हो गया
  कुछ तो जादूगरी है तेरे क़िरदार में
  तुझसे मोहब्बत करके मेरा नाम हो गया""",
    """  जब आँखें खुले तो सामने तेरा चेहरा हो
  तेरे साथ ही मेरी ज़िंदगी का हर सवेरा हो
  इस प्रेम में मेरी एक ही ख़्वाहिश बाकी
  मेरी हर ख़ुशी तेरी और तेरा हर ग़म मेरा हो""", """हम अपने इख़्तियार की हद से गुजर गए,
  चाहा तुम्हें तो प्यार की हद से गुजर गए,
  जागी है अपने दिल में गुलाबों की आरज़ू,
  जब मौसम-ए-बहार की हद से गुजर गए""",
    """चुपके से आकर इस दिल में उतर जाते हो,
  सांसों में मेरी खुशबु बनके बिखर जाते हो,
  कुछ यूँ चला है तेरे इश्क का जादू,
  सोते-जागते तुम ही तुम नज़र आते हो""",
    """लोग तो मरते हैं हुस्न पर
  मेरा दिल तो तेरी गुफ्तगू पर मरता है""",
    """ मेरे प्रेम की शायरी तुम हो
  पागलपन की समझदारी तुम हो
  जब भी कुछ लिखने बैठा तो
  मेरी कलम मेरी डायरी तुम हो""",
    """मेरे दिल को तेरे दिल से बेहद प्रेम हो गया
  तुझे याद करना धड़कन से ज़रूरी काम हो गया
  कुछ तो जादूगरी है तेरे क़िरदार में
  तुझसे मोहब्बत करके मेरा नाम हो गया""",
    """  जब आँखें खुले तो सामने तेरा चेहरा हो
  तेरे साथ ही मेरी ज़िंदगी का हर सवेरा हो
  इस प्रेम में मेरी एक ही ख़्वाहिश बाकी
  मेरी हर ख़ुशी तेरी और तेरा हर ग़म मेरा हो""",
  ];
  static List sad = [
    """अपने चेहरे से जो ज़ाहिर है छुपाएँ कैसे
  तेरी मर्ज़ी के मुताबिक़ नज़र आएँ कैसे""",
    """ऐ मोहब्बत तेरे अंजाम पे रोना आया
  जाने क्यूँ आज तेरे नाम पे रोना आया""",
    """नींद तो दर्द के बिस्तर पे भी आ सकती है
  उनकी आग़ोश में सर हो ये ज़रूरी तो नहीं""",
    """बेनाम सा ये दर्द ठहर क्यूँ नहीं जाता
  जो बीत गया है वो गुज़र क्यूँ नहीं जाता""",
    """अब के सफ़र में दर्द के पहलू अजीब हैं
  जो लोग हम-ख़याल न थे हम-सफ़र हुए""",
    """कुछ खोने का दर्द कुछ ना पा सकने के दर्द से कहीं ज्यादा होता है।""",  """अपने चेहरे से जो ज़ाहिर है छुपाएँ कैसे
  तेरी मर्ज़ी के मुताबिक़ नज़र आएँ कैसे""",
    """ऐ मोहब्बत तेरे अंजाम पे रोना आया
  जाने क्यूँ आज तेरे नाम पे रोना आया""",
    """नींद तो दर्द के बिस्तर पे भी आ सकती है
  उनकी आग़ोश में सर हो ये ज़रूरी तो नहीं""",
    """बेनाम सा ये दर्द ठहर क्यूँ नहीं जाता
  जो बीत गया है वो गुज़र क्यूँ नहीं जाता""",
    """अब के सफ़र में दर्द के पहलू अजीब हैं
  जो लोग हम-ख़याल न थे हम-सफ़र हुए""",
    """कुछ खोने का दर्द कुछ ना पा सकने के दर्द से कहीं ज्यादा होता है।""",  """अपने चेहरे से जो ज़ाहिर है छुपाएँ कैसे
  तेरी मर्ज़ी के मुताबिक़ नज़र आएँ कैसे""",
    """ऐ मोहब्बत तेरे अंजाम पे रोना आया
  जाने क्यूँ आज तेरे नाम पे रोना आया""",
    """नींद तो दर्द के बिस्तर पे भी आ सकती है
  उनकी आग़ोश में सर हो ये ज़रूरी तो नहीं""",
    """बेनाम सा ये दर्द ठहर क्यूँ नहीं जाता
  जो बीत गया है वो गुज़र क्यूँ नहीं जाता""",
    """अब के सफ़र में दर्द के पहलू अजीब हैं
  जो लोग हम-ख़याल न थे हम-सफ़र हुए""",
    """कुछ खोने का दर्द कुछ ना पा सकने के दर्द से कहीं ज्यादा होता है।""",
  ];
  static List clr = [
    // Colors.grey,
    Colors.red,
    Colors.amberAccent,
    Colors.purple,
    Colors.deepPurpleAccent,
    Colors.lime,
    Colors.tealAccent,
    Colors.deepOrange,
    Colors.cyan,
    Colors.purpleAccent,
    Colors.brown,
    Colors.redAccent,
    Colors.greenAccent,
    Colors.pinkAccent,
    Colors.lightGreenAccent,
    Colors.white,
    Colors.orange,
    Colors.indigo,
    Colors.yellowAccent,
    Colors.blueGrey,
    Colors.deepOrangeAccent,
    Colors.lightBlueAccent,
    Colors.orangeAccent,
    Colors.white30,
    Colors.limeAccent,
    Colors.black
  ];
}
